package Practice160424;

public class Task04 {
	
	public static void main(String[] args) {
		
		/*
		 * Создать программу, проверяющую и сообщающую на экран, является ли целое число записанное в переменную n, чётным либо нечётным.
		 */
		
		int x = 6;
		
		if(x % 2 != 0){
			System.out.println("нечетное");
		}else{			
			System.out.println("четное");
		}
		
	}

}
